Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_primary_school/giving_children_an_even_break_by_tackling_disadvantage.html.txt.tmx
Source language: en
Languages: ga

source: Tackling disadvantage in primary schools
ga: Ag dul i ngleic le míbhuntáiste i mbunscoileanna

source: The Department of Education and Skills has several schemes aimed at tackling educational disadvantage in primary schools
ga: Tá roinnt scéimeanna ag an Roinn Oideachais agus Scileanna a bhfuil sé mar aidhm acu dhul i ngleic le míbhuntáiste oideachais i mbun scoileanna

source: Some of these come within the framework of the Department’s initiative 'Delivering Equality of Opportunity in Schools' (DEIS)
ga: Tagann cuid acu seo laistigh de chreatlach thionscnamh na Roinne, sé sin 'Comhionannas Deiseanna sna Scoileanna a Sheachadadh (DEIS)'

source: This initiative brings together a range of national programmes to address educational disadvantage throughout the school system
ga: Tugann an tionscnamh seo le chéile réimse de chláracha náisiúnta chun dhul i ngleic le míbhuntáiste oideachais tríd an gcóras scolaíochta go léir

source: The School Completion Programme (SCP), introduced in 2002, focuses on young people between the ages of 4 and 18 years of age
ga: Díríonn an Clár Críochnaithe Scoile (SCP), a tugadh isteach in 2002, ar dhaoine óga idir 4 agus 18 mbliana d’aois

source: The programme is a support strand within the Child and Family Agency under the Department of Children and Youth Affairs
ga: Snáithe thacaíochta atá sa chlár laistigh den An Ghníomhaireacht um Leanaí agus an Teaghlach faoin Roinn Leanaí agus Gnóthaí Óige

source: It forms part of the Department of Education and Skills social inclusion strategy Delivering Equality of Opportunity in Schools (DEIS) to help children and young people who are at risk of or who are experiencing educational disadvantage
ga: Cruthaíonn sé cuid de straitéis cuimsithe shóisialta na Roinne Oideachais agus Scileanna, Comhionannas Deiseanna i Scoileanna a Sheachadadh (DEIS) chun cabhrú le leanaí atá i mbaol nó atá faoi mhíbhuntáiste oideachais

source: School Completion Programme aims to keep young people in the formal education system to completion of senior cycle or equivalent and to generally improve the quality of participation and educational attainment
ga: Tá sé de chuspóir ag an gClár Críochnaithe Scoile daoine óga a choimeád sa chóras foirmiúil oideachais go dtí go gcríochnaíonn siad an córas sinsearach nó a chomhionann agus chun feabhas ginearálta a chur ar cháilíocht na rannpháirtíochta agus na gnóthachtála oideachais

source: Each project is managed by a local management committee and provides a tailored programme of in-school, after school and holiday time interventions to targeted children and young people who are at risk of early school leaving
ga: Déanann coiste bainistíochta áitiúil gach tionscadal a bhainistiú agus cuireann siad clár saincheaptha idirghabhála le linn am scoile, i ndiaidh am scoile agus le linn am saoire ar fáil do leanaí agus d’ógánaigh sprioctha atá i mbaol an scoil a fhágáil go luath

source: The programme provides flexibility for schools to develop more effective strategies, like out-of-school support and outreach, family support, mentoring, staff development and parental involvement
ga: Cuireann an clár solúbthacht ar fáil do scoileanna chun straitéisí níos éifeachtaí a fhorbairt, ar nós tacaíochta agus for-rochtana lasmuigh den scoil, tacaíocht teaghlaigh, meantóireacht, forbairt foirne agus baint na dtuismitheoirí

source: The School Meals Programme is a separate programme funded by the Department of Social Protection and local authorities
ga: Is clár éagsúil é Clár na mBéilí Scoile maoinithe ag an Roinn Coimirce Sóisialaí agus údaráis áitiúil

source: It aims to supplement the diets of school-going children from disadvantaged backgrounds to help them fulfil their potential within the educational system and to reduce the risk of early school leaving
ga: Tá sé mar aidhm aige seo cur le aiste bia pháistí scoile ó chúlra míbhuntáiste chun cabhrú leo bheith chomh maith agus is féidir leo laistigh den gcóras oideachais agus an baol go bhfágfaidís an scoil luath a mhaolú

source: There are two schemes
ga: Tá dhá scéim ann

source: The Urban Scheme supports school meals for primary schools in urban areas
ga: An Scéim Uirbeach a thacaíonn le béilí scoile do bhunscoileanna i gceantracha uirbeacha

source: This programme consists of daily sandwiches or buns and milk
ga: Bainne, ceapairí nó borróga atá sa chlár seo

source: The scheme is not a replacement for home meals
ga: Ní thógann sé áit béilí te an bhaile

source: The Local Projects Scheme gives funding directly to national and secondary schools, local groups and voluntary organisations, which operate their own school meals projects (the meals may be hot or cold)
ga: Tugann An Scéim Tionscnaimh Áitiúla maoiniú díreach do na scoileanna náisiúnta agus dara leibhéil, grúpaí áitiúla agus eagraíochtaí deonacha, a oibríonn a gcuid béilí scoile féin (d'fhéadfadh na béilí a bheith fuar nó te)

source: In 2004 the scheme was extended to nursery schools catering for disadvantaged pre-school children
ga: I 2004 méadaíodh an scéim chuig scoileanna naíonáin chun aire a thabhairt do pháistí réamhscolaíochta

source: These meals must be targeted at areas of disadvantage or at children with special needs
ga: Caithfear na béilí seo a thabhairt do cheantair faoi mhíbhuntáiste nó do ghasúir le riachtanais speisialta

source: Funding is allocated on the basis of a rate per meal per child
ga: Tá maoiniú ar fáil ar rátaí béile do gach páiste

source: The School Milk Scheme entitles schoolgoing children to a quarter litre of milk on each school day
ga: Tugann an Scéim Bainne Scoile ceathrú lítear de bhainne do gach gasúr ar scoil gach lá

source: Pre-schools, primary and second-level schools are eligible for the Scheme, which is funded by the EU and the Irish Government
ga: Tá réamh-scoileanna, bunscoileanna agus scoileanna dara leibhéil i dteideal na scéime atá maoinithe ag an AE agus ag an Rialtas

source: Crèches and other childminding concerns which are operated for commercial gain are not eligible under the rules of the School Milk Scheme
ga: Níl creiseanna ná áiteanna eile cúram leanaí atá ag oibriú ar bhun tráchtála i dteideal de réir rialacha na scéime

source: For further information on DEIS contact the Social Inclusion Unit of the Department of Education and Skills
ga: Chun tuilleadh eolais a fháil ar DEIS déan teagmháil leis an Aonad Cuimsiú Sóisialta sa Roinn Oideachais agus Scileanna

source: For further information on the Schools Meals Scheme contact the local authority or the Department of Social Protection
ga: Chun tuilleadh eolais a fháil faoin Scéim Béilí Scoile déan teagmháil leis an údarás áitiúil nó an Roinn Coimirce Sóisialaí

source: You can get an application form for the School Meals Local Projects Scheme (pdf)
ga: Íoslódáil an fhoirm iarratais don Scéim Béilí Scoile (pdf)

source: You can also get the Good Practice Guide for School Food Initiatives
ga: Is féidir leat Treoir Dheá-Chleachtais do Thionscnaimh na mBéilí Scoile a íoslódáil
